postman-stress-test.yml
config:
  target: 'https://postman-echo.com'
  phases:
    - duration: 60
      arrivalRate: 10

payload:
  path: './keywords.csv'

scenarios:
  - flow:
      - post:
          url: '/post'
          json:
            key: '{{ payload }}'
          expect:
            - statusCode: 200
            - responseTime:
                max: 200
            - p95: 
                max: 200
      - get:
          url: '/get'
          expect:
            - statusCode: 200
            - responseTime:
                max: 200
            - p95: 
                max: 20